{
  "semantics": [
    {
      "label": "Média",
      "fields": [
        {
          "label": "Type",
          "description": "Média à afficher au-dessus de la question (facultatif)."
        },
        {
          "label": "Désactiver le zoom sur image"
        }
      ]
    },
    {
      "label": "Consigne",
      "description": "La consigne indique ce que l'utilisateur doit faire.",
      "default": "Glissez-déposez les mots ou groupes de mots dans les emplacements qui leur correspondent."
    },
    {
      "label": "Text",
      "placeholder": "*Oslo* est la capitale de la Norvège, *Stockholm* est la capitale de la Suède et *Copenhague* est la capitale du Danemark. Toutes ces villes sont situées dans la péninsule *Scandinave:Partie nord de l'Europe*. Maths : *2\\*3* = 6 et *12\\:3* = 4",
      "description": "",
      "important": {
        "description": "<ul><li>Tutoriel et Exemples: <a href=\"https://www.rezeau.org/moodle/course/view.php?id=12&lang=fr\" target=\"_blank\" rel=\"noopener\">Le site de test Moodle de Papi Jo</a></span></li><li>Les mots (ou groupes de mots) qui seront supprimés du texte pour figurer dans la liste des éléments à glisser/déposer doivent être encadrés avec un astérisque (*) devant et derrière.</li><li>Des astérisques et deux points (:) peuvent être ajoutés à l'intérieur des mots/phrases à glisser/déposer en les échappant (avec une barre oblique inverse). Voir l'exemple 3 ci-dessous.</li><li>Vous pouvez ajouter un indice en plaçant un DOUBLE caractère 2 points (::) avant cet indice.</li><li>Vous pouvez ajouter un feedback qui apparaîtra une fois l'exercice terminé. Utilisez '\\+' pour créer le feedback en cas de réponse correcte et '\\-' pour le feedback en cas de mauvaise réponse.</li><li>Vous pouvez fournir des réponses correctes alternatives en utilisant des barres obliques comme séparateurs. Voir l'exemple 5 ci-dessous.</li><li>Vous pouvez également ajouter un bloc de texte distracteur supprimable, entre des traits de soulignement. Voir l'exemple 4 ci-dessous.</li><li>Vous pouvez utiliser un style de formatage en ligne tel que &lt;em&gt;&lt;/em&gt ;. Voir l'exemple 5 ci-dessous.</li></ul>",
        "example": "1.- Les contenus H5P peuvent être édités en utilisant un *navigateur::Quel type de programme utilisez vous pour consulter des sites Internet ?*. <br /> 2.- Un contenu H5P est *interactif\\+Correct ! \\-Incorrect, Recommencez !*<br />3.- Maths: *2\\*3* = 6 et *12\\:3* = 4<br />4.- Ce matin, j'ai rencontré mon ami John et je lui ai dit *_Enchanté de te rencontrer_Salut, John!::Utilisez une expression plus familière*.</br>5.- Le chien a couru après *le chat <em>noir</em>/l'oiseau/le facteur*"
        }
    },
    {
      "label": "Supprimer les sauts de ligne supplémentaires après les paragraphes importés.",
      "description": "Le texte importé depuis la source d'un éditeur WYSIWYG peut contenir des balises de paragraphe < p > ou des balises de sauts de ligne < br >, qui seront automatiquement supprimées. Si vous souhaitez également supprimer d'éventuels sauts de ligne après ces paragraphes, cochez cette option."
    },
    {
      "label": "Distracteurs",
      "placeholder": "*Paris* *Marseille*",
      "description": "Indiquez les réponses optionnelles supplémentaires qui sont fausses en tant que distracteurs. Utilisez le même schéma d'astérisque (*) que pour le texte."
    },
    {
      "label": "Feedback général",
      "fields": [
        {
          "widgets": [
            {
              "label": "Par défaut"
            }
          ],
          "label": "Définissez le feedback pour chaque intervalle de scores",
          "description": "Cliquez sur le bouton \"Ajouter Intervalle\" pour ajouter autant d'intervalles que vous le souhaitez. Exemple: 0-20% Mauvais score, 21-91% Score moyen, 91-100% Score excellent !",
          "entity": "intervalle",
          "field": {
            "fields": [
              {
                "label": "Intervalle de score"
              },
              {},
              {
                "label": "Feedback pour un intervalle de score défini",
                "placeholder": "Remplir le feedback"
              }
            ]
          }
        }
      ]
    },
    {
      "label": "Texte du bouton \"Vérifier\"",
      "default": "Vérifier"
    },
    {
      "label": "Text for \"Submit\" button",
      "default": "Submit"
    },
    {
      "label": "Texte du bouton \"Recommencer\"",
      "default": "Recommencer"
    },
    {
      "label": "Texte pour le bouton \"Voir la correction\"",
      "default": "Voir la correction"
    },
    {
      "label": "Etiquette de la zone de dépôt numérotée",
      "default": "Zone de dépôt @index.",
      "description": "Etiquette utilisée pour l'accessibilité quand la synthèse vocale annonce le numéro de la zone de dépôt. Variable disponible : @index"
    },
    {
      "label": "Etiquette zone de dépôt vide",
      "default": "La zone de dépôt @index est vide.",
      "description": "Etiquette utilisée pour l'accessibilité quand la syntèse vocale annonce que la zone de dépôt est vide"
    },
    {
      "label": "Etiquette pour la zone de dépôt contient",
      "default": "La zone de dépôt @index contient un élément déplaçable @draggable.",
      "description": "Etiquette utilisée pour l'accessibilité quand la syntèse vocale annonce que la zone de dépôt contient un élément déplaçable"
    },
    {
      "label": "Etiquette pour les éléments à déplacer",
      "default": "@index sur @count éléments déplaçables.",
      "description": "Etiquette utilisée pour l'accessibilité quand la syntèse vocale annonce que c'est un élément déplaçable. Variables disponibles : @index, @count"
    },
    {
      "label": "Etiquette pour le bouton d'indice",
      "default": "Montrer l’indice",
      "description": "Etiquette utilisée pour l'accessibilité quand la syntèse vocale annonce l'indice"
    },
    {
      "label": "Texte exprimé par la synthèse vocale en cas de réponse correcte",
      "default": "Correct !"
    },
    {
      "label": "Texte exprimé par la synthèse vocale en cas de réponse incorrecte",
      "default": "Incorrect !"
    },
    {
      "label": "Intitulé de dialogue pour confirmer que l'utilisateur souhaite reparamétrer l'élément déplaçable",
      "default": "Reparamétrer le déplacement"
    },
    {
      "label": "Description du dialogue de confirmation pour reparamétrer un élément déplaçable",
      "default": "Etes-vous certain de vouloir reparamétrer cet élément déplaçable ?"
    },
    {
      "label": "Etiquette utilisée pour l'accessibilité quand la synthèse vocale annonce que le déplacement d'un élément est initié",
      "default": "L'élément déplaçable est saisi."
    },
    {
      "label": "Etiquette utilisée pour l'accessibilité quand la synthèse vocale annonce que le déplacement de l'élément est annulé",
      "default": "Annuler le déplacement."
    },
    {
      "label": "Etiquette utilisée pour l'accessibilité quand la bonne réponse est annoncée par la synthèse vocale",
      "default": "Réponse correcte :"
    },
    {
      "label": "Intitulé de l'espace contenant des feedbacks pour des réponses correctes/incorrectes",
      "default": "Commentaire de retour"
    },
    {
      "label": "Options générales.",
      "description": "Ces options vous permettent de contrôler le déroulement de vos activités.",
      "fields": [
        {
          "label": "Activer le bouton \"Recommencer\""
        },
        {
          "label": "Correction instantanée"
        },
        {
          "label": "Activer le bouton \"Voir la solution\""
        },
        {
          "label": "Exiger que toutes les zones soient remplies avant que le message « Voir la solution » puisse s'afficher."
        },
        {
          "label": "Activer le bouton \"Vérifier\""
        },
        {
          "label": "Afficher des zones de dépôt courtes",
          "description": "Cochez cette option si vous souhaitez afficher des zones de dépôt courtes (utile lors de l'utilisation de petits écrans, par exemple un téléphone)."
        },
        {
          "label": "Trier les éléments de texte à faire glisser en ordre alphabétique.",
          "description": "Cochez cette option si vous souhaitez trier les éléments de texte à faire glisser par ordre alphabétique (plutôt que de manière aléatoire)."
        },
        {
          "label": "Conserver les réponses correctes",
          "description": "Cochez cette option si vous voulez que les éléments de texte à glisser-déposer restent placés dans les bons emplacements après avoir appuyé sur 'Réessayer'."
        },
        {
          "label": "Afficher les feedbacks corrects et incorrects sur fond transparent",
          "description": "Cochez cette option si vous souhaitez afficher les éléments de texte à glisser-déposer corrects et incorrects sans fond de couleur (ni symbole correct/incorrect) lors de la vérification des réponses. Utile lorsque les éléments à glisser-déposer sont des parties de mots."
        },
        {
          "label": "Afficher la liste des mots à faire glisser sous le texte à trous",
          "description": "Cochez cette option pour afficher la liste des mots à faire glisser sous le texte à trous. Ne cochez pas cette option si vous préférez afficher sur 2 colonnes."
        },
        {
          "label": "Largeur de la colonne de gauche",
          "description": "Si vous avez choisi d'afficher le texte à trous et les mots à faire glisser sur deux colonnes, vous pouvez sélectionner la largeur de la colonne de gauche (c'est-à-dire le texte à trous).",
          "options": [
            {
              "label": "33%"
            },
            {
              "label": "50%"
            },
            {
              "label": "75%"
            }
          ]
        }
      ]
    },
    {
      "label": "Représentation textuelle du panneau du score pour les utilisateurs des outils de la vocalisation (comme ReadSpeaker)",
      "default": "Vous avez obtenu :num sur un total de :points"
    },
    {
      "label": "Étiquette de technologie d'assistance pour le bouton Vérifier",
      "default": "Vérifiez les réponses. Les réponses seront marquées comme correctes, incorrectes ou sans réponse."
    },
    {
      "label": "Étiquette de technologie d'assistance pour le bouton Voir la correction",
      "default": "Montrer la solution. La tâche sera marquée avec la solution correcte."
    },
    {
      "label": "Étiquette de technologie d'assistance pour le bouton Recommencer",
      "default": "Recommencez la tâche. Réinitialisez toutes les réponses et recommencez la tâche."
    }
  ]
}